Repository: regexplanet/regexplanet-translations
Catalog: text/*.po
Languages: de

source: %engines.bottom.html
de: <p>Sehen Sie sich die <a href="api.html">API specs</a> an, wenn sie die Unterstützung für eine anderea engine hinzufügen wollen</p><p>Heir sehen Sie <a href="options.html">die unterschiedlichen Optionen</a>, die die jeweilige engine unterstützt.</p>

source: %html.lang.attribute
de: de-x-mtfrom-en

source: %request.html
de: Sie finden nicht was Sie brauchen? <a href="request.html">Fordern Sie ein Rezept</a> an!

source: %share.tip.html
de: Einen share code erzeugen um diese regular expression, die Optionen, die Ersetzungen und alle Test Eingaben zu teilen.<br/><br/>Beachten Sie, dass die regexs für alle sichtbar sind, teilen Sie deshalb keine privaten Daten!

source: A badly formed regular expression can run forever, making it very useful for denial of services attacks. Some of the engines/hosts are susceptible to these. Check the current engine status to see if they are running.
de: Ein bösartig fromuliertet Ausdruck kann unendlich lange brauchen, was ihn sehr nützlich für Denial of Service Angriffe macht. Manche der Engines/Hosts sind anfällig für solche Ausdrücke. Überprüfen Sie den altuellen Status einer Engine um zu sehen ob sie läuft.

source: All Recipes
de: Alle Rezepte

source: Allow comments in regex (COMMENTS)
de: Kommentare erlauben in regex (COMMENTS)

source: Allow comments in regex [COMMENTS] (x flag)
de: Kommentare erlauben in regex [COMMENTS] (x Option)

source: Cancel
de: Abbrechen

source: Case insensitive (CASE_INSENSITIVE)
de: Groß-/Kleinschreibung ignorieren (CASE_INSENSITIVE)

source: Case insensitive [CASE_INSENSITIVE] (i flag)
de: Groß-/Kleinschreibung ignorieren [CASE_INSENSITIVE] (i flag)

source: Case insensitive matching (IGNORECASE)
de: Ohne Groß-/Kleinschreibung vergleichen (IGNORECASE)

source: Case-insensitive matching (IgnoreCase)
de: Ohne Groß-/Kleinschreibung vergleichen (IgnoreCase)

source: Case-insensitive matching (i)
de: Ohne Groß-/Kleinschreibung vergleichen (i)

source: Compile error
de: Kompilierungsfehler

source: Cookbook:
de: Kochbuch:

source: Credits
de: Danksagungen

source: Current Status
de: Aktueller Status

source: Dot matches all (s)
de: Punkt steht für alle Zeichen (s)

source: Dot matches line terminator (DOTALL)
de: Punkt steht auch für Zeilenende (DOTALL)

source: Dot matches line terminator [DOTALL] (s flag)
de: Punkt steht auch für Zeilenende [DOTALL] (s flag)

source: ECMAScript-compliant behavior. This value can be used only in conjunction with the IgnoreCase, Multiline, and Compiled values. (ECMAScript)
de: ECMAScript-konformes Verhalten. Dieser Wert kann nur in Verbindung mit den IgnoreCase, Multiline und Compiled values verwendet werden. (ECMAScript)

source: Eliminate unescaped white space from the pattern and enable comments marked with # (IgnorePatternWhitespace)
de: Beseitige nicht markierte Leerzeichen aus dem Muster und ermögliche Kommentare, die mit # anfangen (IgnorePatternWhitespace)

source: Explicit capture (n)
de: Nur explizit benannte gespeicherte Gruppen (n)

source: Expression to test
de: Ausdruck zum Testen

source: Extended with whitespace and comments (x)
de: Erweitert mit Leerzeichen und Kommentaren (x)

source: Featured
de: Besonders gut

source: Featured Recipes
de: Besonders gute Rezepte

source: Force canonical equivalence (CANON_EQ)
de: Beachten kanonischer Äquivalenz erzwingen (CANON_EQ)

source: Force canonical equivalence [CANON_EQ]
de: Beachten kanonischer Äquivalenz erzwingen [CANON_EQ]

source: Free-spacing and line comments (x)
de: Leerzeichen überall erlaubt und zeilenweise Kommentare (x)

source: Frequenty Asked Questions
de: wrong in english

source: Global match (g)
de: Muster überall finden (g)

source: Go
de: Start

source: Historical Performance
de: Frühere Performance

source: History
de: Verlauf/Chronik

source: Ignore whitespace in the regular expression (EXTENDED)
de: Ignoriere Leerzeichen im regulären Ausdruck (EXTENDED)

source: Input {0}:
de: Angabe {0}:

source: Invalid share code
de: Ungültiger Teilen-Code

source: Keep current position (c)
de: Die aktuelle Position merken (c)

source: Known Regular Expression Engines
de: Bekannte Engines für Reguläre Ausdrücke

source: License
de: Lizenz

source: Login
de: Anmelden

source: Logout
de: Abmelden

source: Make share code
de: Teilen Code erzeugen

source: Matches must start at lastIndex (y) NOTE: not supported at RegexPlanet
de: Gefundenes muss nach lastindex anfangen (y) Bitte beachten: RegexPlanet unterstützt das nicht

source: Metadata
de: Metadaten

source: Mine
de: Meins

source: More Inputs
de: Mehr Angaben

source: My Recipes
de: Meine Rezepte

source: Need help on a specific regex? Make a share code, then post it on the <a href="/cookbook/request.html">Request a Recipe</a> page
de: Brauchen Sie Hilfe bei einem besitmmten Ausdruck? Erstellen Sie einen Teilen-Code und dann posten sie ihn auf der <a href="/cookbook/request.html">gesuchten Rezepte</a> Seite

source: No
de: Nein

source: Official Documentation Links
de: Links zur offiziellen Dokumentation

source: One last thing
de: Eine letzte Sache noch

source: Online Regular Expression Testing
de: Online-Testen für Reguläre Ausdrücke

source: Online Testing
de: Onlne-Testen

source: Online testing with the {0} engine is not complete - alpha testing only!
de: Online-Testen mit Engine {0} ist noch nicht fertig - nur alpha Qualität!

source: Online testing with the {0} engine is still in beta.
de: Online-Testen mit Engine {0} ist noch im Beta Stadium.

source: Only consider '\n' as line terminator (UNIX_LINES)
de: Nur '\n' als Zeilenende ansehen (UNIX_LINES)

source: Only consider '\n' as line terminator [UNIX_LINES]
de: Nur '\n' als Zeilenende ansehen [UNIX_LINES]

source: Original Expression
de: Eingegebener Ausdruck

source: Other sources
de: Andere Quellen

source: Please include a share code (from one of the test pages). Even if you don't fill in the regex, fill in some inputs so we can see what you are trying to match.
de: Bitte überlegen Sie, ob Sie nicht einen teilen code anschließen (von einer der Testseiten). Auch wenn Sie keine RegEx angeben, geben Sie bitte Angaben an, damit wir sehen was sie zu finden versuchen.

source: Preserve matched strings (p)
de: übereinstimmenden Strings behalten (p)

source: Recent
de: neu

source: Recent Recipes
de: kürzlich eingegebene Rezepte

source: Recipe Requests
de: gesuchte Rezepte

source: Recipes by user
de: Rezepte nach User

source: RegEx: online regular expression testing
de: RegEx: Online-Tests für reguläre Ausdrücke

source: RegexPlanet - Online Regular Expression (Regex) Testing and Cookbook for: {0}
de: RegexPlanet - Online Test für Reguläre Ausdrücke (Regex) und Kochbuch für: {0}

source: RegexPlanet: online regular expression testing for {0}
de: RegEx: Online-Test für regulären Ausdruck {0}

source: Regexp class
de: Regexp-Klasse

source: Regular Expression
de: Regulärer Ausdruck

source: Regular Expression Sharing
de: Teilsen Regulärer Ausdrücke

source: Regular Expression Test Page
de: Seite zum Testen Regulärer Ausdrücke

source: Regular expressions are an incredibly powerful tool, but can be rather tricky to get exactly right. This is a website that I wrote so I could quickly and easily test regular expressions during development.
de: Reguläre Ausdrücke sind ein unglaublich mächtiges Werkzeug, es kann aber auch recht schwierig sein, sie genau richtig hinzubekommen. Dies ist eine Website, die ich erstellt habe, um reguläre Ausdrücke während der Entwicklung schnell und einfach testen zu können.

source: Replacement
de: Ersetzung

source: Replacement:
de: Ersetzung:

source: Running
de: Läuft

source: Security Information
de: Sicherheitsinformationen

source: Select
de: Wählen Sie

source: Select a language
de: Wählen Sie eine Sprache aus

source: Share Codes
de: Teilen Codes

source: Share code
de: Code teilen

source: Share codes are an easy way to share regexes. If you have a share code, enter it here:
de: Teilen Codes sind eine einfache Möglichkeit, reguläre Ausdrücke zu teilen. Wenn Sie einen Teilen Code haben, geben Sie ihn hier ein:

source: Share!
de: Teile!

source: Start Testing!
de: Testen starten!

source: Support
de: Unterstützung

source: Support Links
de: Links für Unterstützung

source: Support Unicode astral characters (A)
de: Unterstütze Unicode Astral-Zeichen (A)

source: Target String
de: Ziel-String

source: Testing
de: Testen

source: The Regex Cookbook
de: Das Regex Kochbuch

source: The original version was Java-based and did not require a JavaScript-enabled browser. No need to use it if the Java one above works for you, but a lot of links go directly to it:
de: Die Originalversion war Java-basiert und verlangte keinen JavaScript-fähigen Browser. Es gibt keinen Grund diese hier zu nutzen, wenn die Java-basierte oben für Sie funktioniert, aber eine Menge Links zeigen direkt dort hin:

source: This engine is not being monitored
de: Diese Engine wird nicht überwacht

source: This will be visible to the public if you share any of your recipes.
de: Dies wird für die Öffentlichkeit sichtbar sein, wenn Sie irgendeines Ihrer Rezepte zu teilen.

source: To Do
de: Zu Tun

source: Tools and services used to build RegexPlanet
de: Werkzeuge und Services, die verwendet wurden, um RegexPlanet zu bauen

source: Treat as a sequence of literal characters (LITERAL)
de: Behandle das als eine Sequenz von Literalen (LITERAL)

source: Unable to load share code {0}
de: Kann Teilen-Code {0} nicht laden

source: Unicode case matching (UNICODE_CASE)
de: Unicode Groß-/Kleinschreibung beim Suchen verwenden (UNICODE_CASE)

source: Unicode case matching [UNICODE_CASE]
de: Unicode Groß-/Kleinschreibung beim Suchen verwenden [UNICODE_CASE]

source: Use ASCII charset rules (a)
de: Verwende ASCII-Zeichensatz Regeln (a)

source: Use Unicode charset rules (u)
de: Verwende Unicode-Zeichensatz Regeln (u)

source: Use default charset rules (d)
de: Verwende Standard-Zeichensatz Regeln (d)

source: Use locale charset rules (l)
de: Verwende locale charset Regeln (l)

source: Use the cookbook to save and share regex recipes.<br/><br/>Note: while you can view anonymously, you must be logged in to save.
de: Verwenden Sie das Kochbuch um regex Rezepte zu speichern und teilen. <br/> Hinweis: Während Sie anonym anzeigen können, müssen Sie angemeldet sein, um zu speichern.

source: You are already logged in.
de: Sie sind schon angemeldet.

source: You are not logged in.
de: Sie sind nicht angemeldet.

source: You are not the owner
de: Sie sind nicht der Besitzer

source: You cannot share blank regular expressions
de: Sie können keine leeren regulären Ausdrücke teilen

source: You created this on a different machine
de: Sie haben das für eine andere Engine erstellt

source: You have to <a href="/security/login.html?next=/cookbook/my.html">login</a> first!
de: Sie müssen sich erst <a href="/security/login.html?next=/cookbook/my.html"> anmelden </ a>!

source: Your sharing link is
de: Ihr Link zum teilen lautet

source: ^ and $ match EOL (MULTILINE)
de: ^ und $ passen auf Zeilenende (MULTILINE)

source: ^ and $ match EOL [MULTILINE] (m flag)
de: ^ und $ passen auf Zeilenende [MULTILINE] (m flag)

source: ^ and $ so they match at the beginning and end, respectively, of any line, and not just the beginning and end of the entire string (Multiline)
de: ^ und $, sodass sie auf Anfang und Ende jeweils einer Zeile passen bzw. irgendeiner Zeile und nicht nur auf den Beginn und das Ende des gesamten Strings (Multiline)

source: ^ and $ so they match at the beginning and end, respectively, of any line, and not just the beginning and end of the entire string (m)
de: ^ und $, sodass sie auf Anfang und Ende jeweils einer Zeile passen bzw. irgendeiner Zeile und nicht nur auf den Beginn und das Ende des gesamten Strings (m)

source: behavior details
de: Ablaufdetails

source: best practices
de: bewährte Vorgehensweisen

source: case-insensitive (i)
de: Groß-/Kleinschreibung ignorieren (i)

source: dot (.) matches every character instead of every character except newlines (Singleline)
de: Punkt (.) entspricht jedem Zeichen anstelle von jedem Zeichen außer Zeilenumbrüche (Singleline)

source: featured
de: besonders gut

source: for Java
de: für Java

source: global - find all matches (g)
de: global- finde alle Übereinstimmungen (g)

source: howto
de: Wie geht das

source: i - Case insensitive (PCRE_CASELESS)
de: i - Groß-/Kleinschreibung ignorieren (PCRE_CASELESS)

source: ignore cultural differences in language (CultureInvariant)
de: kulturbedingte Unterschiede verschiedener Sprachen ignorieren (CultureInvariant)

source: login
de: Anmelden

source: m - ^ and $ match EOL (PCRE_MULTILINE)
de: m - ^ und $ passen auf Zeilenende (PCRE_MULTILINE)

source: metadata
de: Metadaten

source: multiline (m)
de: über mehrere Zeilen (m)

source: only explicitly named or numbered groups of the form (?<name>…) are valid captures (ExplicitCapture)
de: nur explizit benannt oder nummerierte Gruppen in der Form (? <name> ...) werden gespeichert (ExplicitCapture)

source: overview
de: Überblick

source: private
de: privat

source: re man page
de: re Hilfeseite

source: re module
de: re Modul

source: s - Dot matches line terminator (PCRE_DOTALL)
de: s - Punkt passt auf Zielenende (PCRE_DOTALL)

source: search will be from right to left instead of from left to right (RightToLeft)
de: Suche von nach links statt von links nach rechts (RightToLeft)

source: shared
de: geteilt

source: single line (s)
de: einzelne Zeile (s)

source: useful websites for Regex developers
de: nützliche Seiten für Entwickler, die RegEx benutzen

source: {0} Engine Current Status
de: {0} aktueller Engine-Status

source: {0} Engine Historical Performance
de: {0} frühere Engine-Performance

source: {0} Engine Metadata
de: {0} Engine Metadaten
